In [10]:
import pandas as pd

# Sample data dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [20, 30, None, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, None, 70000, 80000],
    'Perfomance Score': [78, None, 90, 80]
}

# Convert the dictionary into two DataFrames
df1 = pd.DataFrame(data)
df1

      Name   Age         City   Salary  Perfomance Score
0    Alice  20.0     New York  50000.0              78.0
1      Bob  30.0  Los Angeles      NaN               NaN
2  Charlie   NaN      Chicago  70000.0              90.0
3    David  40.0      Houston  80000.0              80.0

# interpolation Concept

In [3]:
# perverse integrity 
# smooth trends
# data lose 
#

# interpolate() method

In [11]:
# df1.interpolate(method,axis,)

# method are following 
# # linear 
# # polynomial 
# # time 
# # cube

In [15]:
df1['Age'] = df1['Age'].interpolate(method='linear')
df1

      Name   Age         City   Salary  Perfomance Score
0    Alice  20.0     New York  50000.0              78.0
1      Bob  30.0  Los Angeles      NaN               NaN
2  Charlie  35.0      Chicago  70000.0              90.0
3    David  40.0      Houston  80000.0              80.0